packages/inductiva/inductiva-0.2.3-py3-none-any.whl/inductiva/templates/wind_terrain/openfoam/files/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    model               kEpsilon;

    turbulence          on;

    printCoeffs         on;

    kEpsilonCoeffs
    {
        Cmu         0.09;
        C1          1.44;
        C2          1.92;
        sigmaEps    1.11; // Original value:1.44
        // See:
        // D.M. Hargreaves and N.G. Wright
        // "On the use of the k-Epsilon model in commercial CFD software
        // to model the neutral atmospheric boundary layer",
        // J. of wind engineering and industrial aerodymanics,
        // 95(2007) 355-269
    }
}

// ************************************************************************* //
